from CLA_NET import *
from tools import *
# Find communites for the graph in article

#a="exp1.csv"
#mvc=CLA_NET(a)

#
import pandas as pd
# a = "graph_41.csv"
# b= "graph_41_membership.csv"
# CLA_NET(a,b)
# # #print("data is",data)

import matplotlib.pyplot as plt

# plt.title('بررسی افزایش جگالی یالهای بین انجمن ها بر معیار های خلوص واطلاعات مشترک نرمالسازی شده')
# #plt.xlabel('categories')
# plt.ylabel('معیار های ارزیابی')
#--------------------------------------------------------------------------------


# ---------------------------------------------------------------------------------

#------------------------------------------------------------
modularity=[0.59,0.42,0.35,0.35,0.18,0.18,0.15,0.07,0.03,0.02,0.004,0.01,0.003,0]
plt.grid( linewidth=0.3)
line1,=plt.plot([0,5,10,15,20,25,30,40,50,60,70,80,90,100], modularity,'*-b',)

Silhouette=[0.81,0.57,0.49,0.44,0.26,0.19,0.21,0.08,0.06,0.06,0.05,0.006,0.004,0]
line2, =plt.plot([0,5,10,15,20,25,30,40,50,60,70,80,90,100], Silhouette,'+-r')
plt.legend((line1, line2), ('modularity', 'Silhouette'))
plt.show()

nmi=[1,0.92,0.9,0.83,0.75,0.51,0.44,0.34,0.23,0.21,0.20,0.25,0.19,0.25]
plt.grid( linewidth=0.3)
line1,=plt.plot([0,5,10,15,20,25,30,40,50,60,70,80,90,100], nmi,'*-b',)
purity=[1,0.93,0.83,0.83,0.74,0.6,0.62,0.62,0.49,0.51,0.48,0.48,0.4,0.4]
line2, =plt.plot([0,5,10,15,20,25,30,40,50,60,70,80,90,100], purity,'*-r')

plt.legend((line1, line2), ('nmi', 'purity'))
#-----------------


#----------------------------------finallll internall-------------------
# modularity=[0.35,0.31,0.31,0.38,0.42,0.29,0.26,0.2,0.3,0.23,0.39,0.26,0.31,0.2,0.34,0.22]
# #
# plt.grid( linewidth=0.3)
# # plt.ylim(0,1)
# line1,=plt.plot([0,0.1,0.15,0.2,0.25,0.3,0.35,0.4,0.45,0.5,0.55,0.6,0.65,0.70,0.75,0.8], modularity,'*-b',)
#
# Silhouette=[0.49,0.33,0.27,0.34,0.35,0.24,0.26,0.07,0.14,0.06,0.15,0.08,0.09,-0.02,0.05,-0.003]
# line2, =plt.plot([0,0.1,0.15,0.2,0.25,0.3,0.35,0.4,0.45,0.5,0.55,0.6,0.65,0.70,0.75,0.8], Silhouette,'+-r')
#
# plt.legend((line1, line2), ('modularity', 'Silhouette'))
#
# plt.show()
# nmi=[0.9,0.57,0.61,0.8,0.93,0.77,0.71,0.57,0.72,0.57,0.69,0.37,0.53,0.12,0.08,0.1]
# #
# plt.grid( linewidth=0.3)
# plt.ylim(0, 1)
# line1,=plt.plot([0,0.1,0.15,0.2,0.25,0.3,0.35,0.4,0.45,0.5,0.55,0.6,0.65,0.70,0.75,0.8], nmi,'*-b',)
# #
# purity=[0.83,0.72,0.72,0.79,0.93,0.78,0.66,0.62,0.81,0.68,0.8,0.57,0.68,0.44,0.41,0.45]
# line2, =plt.plot([0,0.1,0.15,0.2,0.25,0.3,0.35,0.4,0.45,0.5,0.55,0.6,0.65,0.70,0.75,0.8], purity,'+-r')
# #
#plt.legend((line1, line2), ('nmi', 'purity'))
#plt.plot( Qbest, 'rx')
plt.show()

plt.show()